-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2020 �?12 �?12 �?05:36
-- 服务器版本: 5.5.53
-- PHP 版本: 5.5.38

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `news`
--

-- --------------------------------------------------------

--
-- 表的结构 `news_list`
--

CREATE TABLE IF NOT EXISTS `news_list` (
  `news_id` int(11) NOT NULL,
  `news_title` varchar(255) NOT NULL,
  `News_author` varchar(255) NOT NULL,
  `release_time` datetime NOT NULL,
  `news_content` text NOT NULL,
  `new_type` int(11) NOT NULL,
  PRIMARY KEY (`news_title`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='新闻列表';

--
-- 转存表中的数据 `news_list`
--

INSERT INTO `news_list` (`news_id`, `news_title`, `News_author`, `release_time`, `news_content`, `new_type`) VALUES
(1607690917, '再试一次', '自己', '2020-12-10 15:00:00', '是顶顶顶顶顶顶顶顶顶顶顶顶', 2),
(1607690960, '还试', '自己', '0000-00-00 00:00:00', '撒打算', 0),
(1607690813, '再试一次修改', '自己', '2020-12-11 22:00:00', '是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶是顶顶顶顶顶顶顶顶顶顶顶顶', 1),
(1607690544, '还得再加一次', '自己', '2020-12-11 20:00:00', '加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加加', 0),
(1607690731, '优秀的程序都是经过千万次的测试才完成的', '自己', '2020-12-11 20:00:00', '试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试试', 0),
(1607690467, '测试需要不得不加', '自己', '2020-12-11 20:00:00', '测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试测试', 1),
(1607750965, '做个最后总结', '黄', '2020-12-12 13:00:00', '要不是这周好多杂事早就做完了。整个项目其实不难，就是对数据库的增删改查，要点再于数据再页面中的传递，做完这个项目感觉php还是挺好的，很好上手，但是进阶可能会比较难，且现在的趋势是前后端分离。还是坚定目标不动摇。', 0),
(1607678682, '最后一次新增标题了', '自己', '2020-12-11 17:00:00', '最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了最后一次新增内容了。', 0),
(1607609866, '我还改', '自己', '0000-00-00 00:00:00', 'fdgdfgdfgfdgdfgdfgfdgdfgdfgfdgdfgdfgfdgdfgdfgfdgdfgdfgfdgdfgdfgg', 0),
(1607611345, '再改一个', '自己', '2020-12-11 21:00:00', 'ggggggggggggggggggggggggggggggggggg', 1),
(1607608246, '最后修改', 'me', '2020-12-12 13:30:00', 'tesssssssssssssssssssssssssssssssssssssssssst', 1);

-- --------------------------------------------------------

--
-- 表的结构 `news_type`
--

CREATE TABLE IF NOT EXISTS `news_type` (
  `type_id` int(11) NOT NULL,
  `type` varchar(255) NOT NULL,
  `remark` varchar(255) NOT NULL,
  PRIMARY KEY (`type_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `news_type`
--

INSERT INTO `news_type` (`type_id`, `type`, `remark`) VALUES
(0, '要闻', '无'),
(1, '热点', '无'),
(2, '专题', '无');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
